app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents"
---
  def index
    @contents = Content.all

INSERT INTO "contents" ("newspaper_id", "comment", "articletext", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["newspaper_id", 1], ["comment", "언제까지 해야지?"], ["articletext", "마스크 계속쓰라고 하네"], ["created_at", "2020-12-18 10:25:35.781619"], ["updated_at", "2020-12-18 10:25:35.781619"]]
---
  def create
    @content = Content.new(content_params)

    respond_to do |format|
      if @content.save

SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_content
      @content = Content.find(params[:id])