app/controllers/newspapers_controller.rb

SELECT "newspapers".* FROM "newspapers"
---
  def index
    @newspapers = Newspaper.all

SELECT "contents".* FROM "contents"
---
  def show
	  @contents = Content.all

INSERT INTO "newspapers" ("name", "article", "reporter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "중앙일보"], ["article", "코로나"], ["reporter", "몰라"], ["created_at", "2020-12-18 09:29:43.878920"], ["updated_at", "2020-12-18 09:29:43.878920"]]
---
  def create
    @newspaper = Newspaper.new(newspaper_params)

    respond_to do |format|
      if @newspaper.save

SELECT  "newspapers".* FROM "newspapers" WHERE "newspapers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_newspaper
      @newspaper = Newspaper.find(params[:id])