app/controllers/platforms_controller.rb

SELECT "platforms".* FROM "platforms"
---
  def index
    @platforms = Platform.all

SELECT COUNT(*) FROM "platforms" WHERE "platforms"."user_id" = $1 AND "platforms"."newspaper_id" = $2  [["user_id", 1], ["newspaper_id", 1]]
INSERT INTO "platforms" ("user_id", "newspaper_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["newspaper_id", 1], ["created_at", "2020-12-18 09:37:56.207950"], ["updated_at", "2020-12-18 09:37:56.207950"]]
---
  def create
    @platform = Platform.new(platform_params)
	user_id = @platform.user_id
	  newspaper_id = @platform.newspaper.id
	  @overlap = Platform.where(user_id: user_id, newspaper_id: newspaper_id).size
    respond_to do |format|
      if @platform.save

DELETE FROM "platforms" WHERE "platforms"."id" = $1  [["id", 3]]
---
  def destroy
    @platform.destroy

SELECT  "platforms".* FROM "platforms" WHERE "platforms"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_platform
      @platform = Platform.find(params[:id])